app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "hibba"], ["email", "hibbabinterizwan@gmail.com"], ["phone_number", "+923215160300"], ["created_at", "2024-01-07 16:42:32.995833"], ["updated_at", "2024-01-07 16:42:32.995833"]]
---
  def create
    @user = User.new(user_params)

    if @user.save